Firma/nalog_encrypted_and_signed.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns2:getNalogZaPlacanjeRequest xmlns:ns2="http://nalogZaPlacanje.com"><xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Content"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:KeyName>Sifrovan tajni kljuc</ds:KeyName>
<xenc:EncryptedKey><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/><xenc:CipherData><xenc:CipherValue>M2rtsfBDWMjHH2koH7cCaGLXOYXBfpP8FfN7ouD5uVVznXTcx+hACk5DnlCRu1Z0UQwJoMQoCjej&#13;
Ry4RlvNv1m2Se6/E7tbDxlsQ3wtpmQACoyJUYkhg0CcqJeUV1vg0MIZEAwNKPQcnsXxnXZdJCH7J&#13;
7s87iqYVL1ZuXtSrZyI=</xenc:CipherValue></xenc:CipherData></xenc:EncryptedKey></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>b5MLFubhIOrkCxJiwTdUMEGE4FZEVur+ESi36LiXC9UreNp+qTdbflCsGhfuzqnV7EIsZ4UUwX0R&#13;
haeHrv5LWrXyYngf3OslC5y1JdwVUm2bgts/xvnAbBNnYCS8vy1zO3pM+8SF9Gnlo3CpnvHr8OLb&#13;
79K+H8WX5SQEXDlw8ptO9NimmMApSGB0baPDYYItsh4UptuD1sW8+7C2skDpvBCggRWOa9jZOOMD&#13;
rybfrnh324q11i4InA0iOS9FuPA8GHleY6E8VMksJ7SLxWq+n6BKJXKTYuNvaiAaIFI87Otf3/VB&#13;
/2StWSIQeEtY71tZ/X4McGpdIO13KVwlyrRgiZfEo37Eb4i9J+ngoe9bBMvmSD/P5I+nVFG6HlSG&#13;
9jBX+a5sMb8rBqXnc7U8lF/gP1IPjwQDbaTowSPy708eLmt3ECbymnCwn+QSKfmNtkcc9hntfFxj&#13;
YkED9cv8cw21gXt79b+08WOW0kbNwLg7LjgwpE7ryahuCc2OAnjkoasg7oE9QEDbDjOEm5aSwPfH&#13;
fDWwpyVjSkFlK7u1n60w+aXIC6u46IKvbZT9sVgCDQwbz9xi2sMAhRCrZvwwhV04IgAIOiQW1+Kl&#13;
cSBRaTvWR7fN17ZdaA0ONCZoNAtIJJsv70DQtx53bPRuSIha0Oq4N7xqzDtKPwz4c+Cz0SSKSTCZ&#13;
T0J1VVv4Sl00xVW48NapqDHLk9HQNUGpEeTywnQRwddZPseTj+/rRNSvEW+8tBJbqxuk1RnbeQct&#13;
3RgwC9102jO+1MRS3gWi3LsX27Wm5VO32xvKb/4Uwzr9OrxaO3GxUkRhh1p48qoADcdT59um06ji&#13;
kjenCX4rTGhG3EUvekBfuRMBWMN5UKl0oZ7nR+XJdNvbjaWvr/znwmji5NRbvjsj40IOc2BcvTRy&#13;
zeGDW61PDBuR8vtv3HH4Ij3qQAXtThgctL7IKiPW3f0m1D7k</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></ns2:getNalogZaPlacanjeRequest></SOAP-ENV:Body><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<ds:Reference URI="">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
<ds:Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315#WithComments"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>caz6wGqMDfLMz3M5zCYHgCjkw/w=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>
nCC3IUjQdSJl6sQG06b1Du4F1LuV14iRg45lnuQLlKtGZ8l4o/hrGCJHbf0m81udQjQqAm3M+yox&#13;
Knn3UPBrLj8Jf+MKXvjli3B1PTE+ufEsSRarMnNvMCFla63kRHtdKnjO1KRvPxx2X5QFUKxlUqTD&#13;
Naw9JFMkEY7dSnRJV2c=
</ds:SignatureValue>
<ds:KeyInfo>
<ds:KeyValue>
<ds:RSAKeyValue>
<ds:Modulus>
zQ9KJLShafi/S2HkWlfnRpKcuLB4BgeJ5y2wBafGRRNz5kss0gjzzQZIDf684gwQ2WYEDlH2s+OX&#13;
fbX4v6KTKJ4ug0wfY05sciJ7Dx+HOPUw6KU5aWvbBIKAXJE+MCSaO/FSk+ujgXSZAY/epUsSqBo2&#13;
EZgUl90oEpTRbV+xX8E=
</ds:Modulus>
<ds:Exponent>AQAB</ds:Exponent>
</ds:RSAKeyValue>
</ds:KeyValue>
<ds:X509Data>
<ds:X509Certificate>
MIIBtjCCAR8CBEZasCQwDQYJKoZIhvcNAQEFBQAwIjEPMA0GA1UECwwGcHJpbWVyMQ8wDQYDVQQD&#13;
DAZwcmltZXIwHhcNMDcwNTI4MTAzNDEyWhcNMjcwNTIzMTAzNDEyWjAiMQ8wDQYDVQQLDAZwcmlt&#13;
ZXIxDzANBgNVBAMMBnByaW1lcjCBnzANBgkqhkiG9w0BAQEFAAOBjQAwgYkCgYEAzQ9KJLShafi/&#13;
S2HkWlfnRpKcuLB4BgeJ5y2wBafGRRNz5kss0gjzzQZIDf684gwQ2WYEDlH2s+OXfbX4v6KTKJ4u&#13;
g0wfY05sciJ7Dx+HOPUw6KU5aWvbBIKAXJE+MCSaO/FSk+ujgXSZAY/epUsSqBo2EZgUl90oEpTR&#13;
bV+xX8ECAwEAATANBgkqhkiG9w0BAQUFAAOBgQB2HjPI427zRaVfLTaeNVcjH9hoTkl9OUJAAmEa&#13;
6EQdbdqZ75ca3IfuLHJFJ8zzyBP4LUGSxgA4OpnKs6Ej5w2n0GHmu0g4YqxInfpv/kCwswoia4Oz&#13;
a17te8mMamffCn3ySX5yZzEex5nueNAyhJkmWBcBCOvJw4+U+gSK50Xbcw==
</ds:X509Certificate>
</ds:X509Data>
</ds:KeyInfo>
</ds:Signature></SOAP-ENV:Envelope>